{
    "locations": [
      {
        "id": "cabin",
        "name": "The Cabin",
        "description": "A safe haven filled with resources to heal after battles, available anytime.",

        "room-text": ["\nYou enter the cabin. In the middle of the room there is a large table cluttered with camp related items.",
         "You enter the cabin.", "You picked up the map from the table. You are now able to access all locations."],

        "items": ["bandage", "map","repair kit"],
        "exits": {"east" : "barn", "north":"church_entrance","west":"trail"}
      },
      {
        "id": "trail",
        "name": "The Trail",
        "items" : [],
        "description": "its a trail towards  the radio tower.",
        "room-text":["\nYou head down a dark trail toward the radio tower. From within the trees you hear a low growl..", "As you continue forward, you see a large creature pounce from the treeline. \n Its bounding towards you, gaining speed with every stride. \n Defend yourself!", 
        "The wendigo pounces, with its massive claws it slashes your throat. \n While your life fades you watch the Wendigo bare its fangs, \n preparing to devour its latest prey.", "The Wendigo pounces, as it raises its arm to deal a blow which would surely be fatal, you draw the sacred blade. \n Right before impact, you swing with all of your might. The blow connects. \n The wenigo wails in pain as the blade sinks into its sternum. \n You watch as the creature collapses and draws its final breath."],
        "exits": {"east" : "cabin" , "west" : "radio_tower"}
      },
      {
        "id": "radio_tower",
        "name": "The Radio Tower",
        "description": "The final goal. Accessible after retrieving the sacred weapon. Without it, the Wendigo's attack is lethal. This is the only way back home.",
        "room-text": ["\nYou climb the stairs to the top of the radio tower.\nAcross the room there is a table with an old radio ontop.",
          "The radio is off..", "The radio turns on! You hear static over the headphones.\n The radio prompts you for a channel..", 
          "You set the channel to the emergency response channel.. \n  There's someone on the other side! \n 'Please help us!' you cry.",
          "After explaining what has happened, the operator on the other end confirms your situation \n and dispatches emergency services. 'We'll be there by morning. Hold tight' he says."],
        "items":["radio"],
        "requirements": ["silver_axe"],
        "exits": {"east" : "trail"}
      },
      {
        "id": "barn",
        "name": "The Barn",
        "description": "You enter an old barn.\nThere are shelves with miscellaneous items on almost every wall.",
        "room-text":["You enter the barn, to your left you seen an old workbench with various tools. A flashlight sits on the top shelf.\nTo your right there is an old gun case with a rifle."],
        "items": ["rifle", "flashlight"],
        "exits": {"west" : "cabin"}
      },

      {
        "id": "church_entrance",
        "name": "The Church",
        "description": "The foreboding entrance to the Cult's church, shrouded in darkness.",
        "room-text":["You enter the front of the church. All of the windows are boarded, blocking any light from entering.\nYou can tell the room is large by the echo of your foot steps.", 
        "There is a large door to your left and a latch on the floor", "The latch is locked.", "The latch opens! You find stairs heading into the church's basement."],
        "requirements": ["flashlight"],
        "items" : [],
        "exits": {"north" : "church_basement","south" :"cabin", "west" : "church_library"}
      },
      {
        "id": "church_library",
        "name": "Church Library",
        "description": "Contains ancient texts explaining the origin of the Wendigo and its weaknesses.",
        "room-text":["The chamber is filled with bookshelves as far as the eye can see, \n each packed with books which appear to be even older than the church itself.  \n A book with a red spine catches your eye. \n across the room you see a large chest with a riddle inscribed above a one word combination lock",
        "You skim through the old text until you come across a passage about an ancient beast.\n The passage reads: 'The Wendigo: a supernatural being belonging to the spiritual traditions of Algonquian-speaking First Nations in North America. \n Windigos are described as powerful monsters that have a desire to kill and eat their victims. \n In most legends, humans transform into windigos because of their greed or weakness.'", "You approach the chest. It requires an 8 letter combination to open.",
        "The chest opens! Inside you find a key with letters from a strange langauge scratched into its side."],
        "items": ["ancient text"],
        "exits": {"east" : "church_entrance"},
        "puzzle": 
          {
            "description": "A chest with a letter combination lock, opened by solving a riddle.",
            "riddle": "It can not be seen whenever it's there. \n It fills up a room, it's much like the air.\n It can not be touched, there's nothing to hear. \n It is quite harmless, there's nothing to fear." ,
            "solution": ["darkness","Darkness"],
            "reward": "basement_key"
          }
      },
      {
        "id": "church_basement",
        "name": "Church Basement",
        "description": "A locked basement holding crucial items for your quest.",
        "room-text":["Hung on the wall you see and axe whose blade is coated in silver.\nIt glistens in the light of your flashlight.\nOn its hilt you see words inscribed in the same language as earlier.\nThere is also a strange looking talisman sitting on a round table.\nSymbols similar to those one the axe are inscribed on the metal object."],
        "requirements": ["basement_key"],
        "items": ["axe","talisman"],
        "exits" : {"south" : "church_entrance"}
      }
    ],
    
    "items": {
      "bandage" : {
        "name": "Medical kit",
        "description": "Restores a significant amount of health.",
        "location": "cabin"
      },
      
      "map" :  {
        "id": "old_map",
        "name": "map",
        "description": "Map of camp and nearby area",
        "location": "cabin"
      },
      "radio" :
      {
        "name": "radio",
        "description": "A radio to contact the outside world",
        "location": "radio_tower"
      },
      
      "rifle": {
        "name": "Old Hunting Rifle",
        "damage" : 10,
        "description": "An old but reliable rifle, useful for defending against threats.",
        "location": "barn"
      },
      "flashlight" : {
        "name": "light",
        "description": "A device to see in the dark",
        "location": "barn"
      },
      "ancient text" : {
        "id": "ancient_text",
        "name": "book",
        "description": "ancient texts explaining the origin of the Wendigo",
        "location": "church_library"
      },
      "key" : {
        "id": "basement_key",
        "name": "Basement Key",
        "description": "The key to unlock the door to the basement.",
        "location": "church_library"
      },
      "axe" : {
        "id": "silver_axe",
        "damage" : 50,
        "name": "Silver axe",
        "description": "The only weapon capable of defeating the Wendigo, hidden in the church basement.",
        "location": "church_basement"
      },
      "repair kit" : {
        "id": "Electronic_Repair_kit",
        "name": "Repair kit",
        "description": "A kit containing wire, electrical tape, screwdrivers, and other tools for fixing electrical equipment.",
        "location": "cabin"
      },
      "talisman" : {
        "id": "Protective Talisman",
        "name": "Necklace",
        "description": "A charm said to ward off dark forces and provide protection against supernatural harm..",
        "location": "church_basement"
      }
    },
    
    "characters": {
      "Nate" : {
        "id": "Nate",
        "name": "Nate Stevens",
        "role": "Leader of the group, tasked with keeping everyone safe.",
        "location": "cabin"
      },
      "Sophia" : {
        "id": "Sophia",
        "name": "Sophia Turner",
        "role": "Girlfriend of Nate and friends of others.",
        "location": "cabin"
      },
      "Rohan" : {
        "id": "Rohan",
        "name": "Rohan Siva",
        "role": "A good friend in your group.",
        "location": "cabin"
      },
      "Ava" : {
        "id": "Ava",
        "name": "Ava Chen",
        "role": "A good friend in your group.",
        "location": "cabin"
      },
      "Daniel" : {
        "id": "Daniel",
        "name": "Daniel Martinez",
        "role": "A good friend in your group.",
        "location": "cabin"
      },
      "Evelyn" : {
        "id": "Evelyn",
        "name": "Evelyn Halloway",
        "role": "Creepy girl that was sitting beside you in the bus, somehow escaped to the cabin during the massacre.",
        "location": "cabin"
      },
      "wendigo" : {
        "id": "wendigo",
        "name": "The Wendigo",
        "description": "A malevolent creature stalking the players, its origins explained in the ancient texts.",
        "location": "variable"
      }
    },
    
    "events" : [

      {
        "id": "intro_cutscene",
        "name": "Campfire Massacre",
        "description": "What was meant to be a fun and carefree night, quickly turned into a living nightmare.",
        "sentences": ["\nHaving recently arrived to the campsite where Nate and his friends would be spending their summer as camp counselors,\nthey were determined to make this their best summer yet.",
                     "To kick off ther first night's bonfire, the group decided to quietly slip away for a drink.",
                     "Returning to the firepit, a horrific scene awaited them.\nThe once cheery campsite was now covered with the remains of their peers.",
                     "Petrified, Nate and his friends made the quick decision to retreat to a nearby cabin for safety."]
      },


      {
        "id": "church_discovery",
        "name": "Discovering the Church",
        "description": "The event where the group discovers the church and its secrets.",
        "sentences" :  
                     ["You: \"This flashlight from the barn is our ticket inside. Let's keep our eyes open for anything useful.\"",
                     "Sophia: \"It's so dark and quiet here... too quiet. I've got a really bad feeling about this place.\"",
                     "Rohan: \"Look at these symbols on the walls... They're like nothing I've ever seen. Evelyn, any idea what they mean?\"",
                     "Ava: \"This place feels ancient. Keep an eye out for anything that might help us understand what we're dealing with.\"",
                     "Daniel: \"Let's stick together. Whatever's in here, we're stronger as a group.\"",
                     "Evelyn: \"These symbols... they speak of the Wendigo. This church, it's not just a place of worship; it's a warning.\""],

        "requirements": ["flashlight"],
        "outcome": ["access to church_basement", "access to church_library"],
        "happened": false
      },


      {
        "id": "basement_confrontation",
        "name": "Defeating the cult members",
        "description": "Defeating the cult members is key to recovering the sacred weapon.",
        "sentences" :  
                     ["Cult Leader: \"Trespassers... You've wandered far too deep into the shadows. Leave now, or face the wrath of forces you cannot comprehend.\"",
                     "Nate: \"We're not here to fight, but we will if we must. We're just after the weapon.\"",
                     "Sophia: \"Can't we talk this out? There doesn't need to be any more violence...\"",
                     "Rohan: \"Looks like talking's off the table. Remember, aim for the non-lethals. We're not killers.\"",
                     "Ava: \"Stay calm, everyone. Let's try to subdue them without causing harm.\"",
                     "Daniel: \"Keep it tight, team. Let's disable and move on. No heroics.\"",
                     "Evelyn: \"Their minds... they're clouded. Be merciful, but be swift. Our fight is not with them, but what controls them.\""],

        "requirements": ["basement_key"],
        "outcome": ["access to radio_tower"],
        "happened": false
      },


      {
        "id": "wendigo_confrontation",
        "name": "Confronting the Wendigo",
        "description": "The final battle with the Wendigo at the radio tower, requiring the sacred weapon.",
        "sentences" :  
                     ["Nate: \" (Drawing the silver axe) This ends now. For all of us, for those we've lost, I won't let this monster win.\"",
                     "Sophia: \"Be careful! We can't lose you too. This thing... it's unlike anything we've ever faced.\"",
                     "Rohan: \"We've got your back. Let's take this monster down together.\"",
                     "Ava: \"That talisman we found, I think it's protecting us. Keep it close!\"",
                     "Daniel: \"This is it, everyone. Keep steady and strike true. We're with you.\"",
                     "Evelyn: \"(As the battle rages) Remember, the Wendigo feeds on fear and greed. Deny it its meal. Fight with courage!\""],
                     
        "requirements": ["silver_axe"],
        "outcome": "kill_wendigo",
        "happened": false
      },


      {
        "id": "radio_tower",
        "name": "radioTowerScene",
        "description": "Final escape",
        "sentences" :  
                     ["Nate: \"We've made it this far. Let's get this radio working and get out of here. Our nightmare ends today.\"",
                     "Sophia: \"Can you imagine going back to normal life after this? I just... it's going to be a long road back.\"",
                     "Rohan: \"Heh, we're gonna be legends, you know? Surviving this... it's a story for the ages.\"",
                     "Ava: \"Let's just focus on getting home. We'll deal with everything else after we're safe.\"",
                     "Daniel: \"Remember everyone we've lost. This victory... it's for them. Let's make sure it wasn't all for nothing.\"",
                     "Evelyn: \"This is only the beginning. The darkness is vast, but today, we've made it a little brighter.\""],

        "outcome": "game_completion",
        "happened": false
      },


      {
        "id": "cabin",
        "name": "CabinScene",
        "description": "To suddenly Finding all the kids dead at the camp",
        "sentences" :  
                     ["Nate: \"We can't just sit around waiting for help. We have to do something. Let's see what we can find around here that might help us.\"",
                     "Sophia: \"OMG, what was that? Why are all the kids dead? This is like a nightmare...\"",
                     "Rohan: \"Man, this is messed up. What do you think happened here? We've got to find a way to protect ourselves.\"",
                     "Ava: \"I never signed up for this when I took the job as a camp counselor. We need to figure out our next move, fast.\"",
                     "Daniel: \"EVERYONE CALM DOWN. Panicking won't help us. Let's take inventory of what we have and make a plan.\"",
                     "Evelyn: \"(Whispers) There's something darker at play here... We need to be cautious. I've read about such things... but to see it in reality...\""],

        "outcome": "game_starting",
        "happened": false
      },


      {
        "id": "trail",
        "name": "TrailScene",
        "description": "its a trail towards  the radio tower.",
        "sentences" :  
                       ["Nate: \"This trail should take us to the radio tower. Stay alert; I don't like the sound of that growl.\"",
                       "Sophia: \"Every shadow looks like it could be hiding something... or someone. Let's stick together.\"",
                       "Rohan: \"Did you hear that? Sounds like we're not alone out here.\"",
                       "Ava: \"It's too quiet... except for that growling. I've got a really bad feeling about this.\"",
                       "Daniel: \"Keep your weapons ready. Whatever's out there, we face it together.\"",
                       "Evelyn: \"The Wendigo... It's close. The growl, the silence, it's hunting us.\""],

        "outcome": "access to radio_tower",
        "happened": false
      }
    ],


    "dialogue" : {
        
      "wendigo" : {
        "fightText" : ["\"RAHHHH\"", "\"REEEE\" ", "\"SCREEECH\"", "\"SCREECH\""] 
      },
    
      "Evelyn" : {
        "hints" : { 
          "church_basement" : "..."
        }
      },

      "cultist" : {
        "fightText" : ["\"You will pay for this before the old gods.\"", "\"You sins shall be paid for in blood.\" ", "\"Your day of reckoning has arrived.\"", "\"Our god shall feast upon your flesh.\""] 
      },

      "player" : {
        "cabin" : ["We can't just sit around waiting for help. We have to do something"],
        "fightText" : ["\"Ouch!\"", "\"Curse you!\"", "\"Die beast!\"", "\"That all you got?\""]
      },

      "Sophia" : {
        "cabin" : ["OMG what was that, why are all the kids dead"],
        "fight text" : ["OMG WE ARE GONNA DIEE!!!!"]
      
      },

      "Rohan" : {
        "cabin" : ["Man, this is messed up. What do you think happened here?"]
      
      },

      "Ava" : {
        "cabin" : ["I never signed up for this when I took the job as a camp counselor"]
      
      },

      "Daniel Martinez" : {
        "cabin" : ["EVERYONE CALM DOWN"]
      
      }
    
  }
    
}
  